Revit 2026 API

# SpaceDesignLightingLoad Property

---

Get or set the Design Lighting Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DesignLightingLoad { get; set; }
```
```vb
Public Property DesignLightingLoad As Double
	Get
	Set
```
```cpp
public:
property double DesignLightingLoad {
	double get ();
	void set (double value);
}
```
```fsharp
member DesignLightingLoad : float with get, set
```

#### Property Value

Double

This property is used to get or set the Design Lighting Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace